// настраиваем скрипт на выпадение навигационного меню при нажатии на бургер
// прописываем три переменные
// Document метод querySelector() возвращает первый элемент (Element) документа, который соответствует 
// указанному селектору или группе селекторов. Если совпадений не найдено, возвращает значение null.
// переменная для нахождения бургера (menu__btn)
const menuBtn = document.querySelector('.menu__btn');
// переменная для нахождения символа закрытия навигационного меню(крестик)
const menuClose = document.querySelector('.menu__close');
// переменная для нахождения навигационного меню и его элементов
const menuList = document.querySelector('.menu__list');

// addEventListener добавляет элементу действие, которое будет выполнено после срабатывания события. 
// например, на клик мышки(click)
// () => {событие} - анонимная функция(стрелочная запись)
// при нажатии(клике) на бургер происходит событие
menuBtn.addEventListener('click', () => {
    // cвойство classList даёт возможность просматривать и манипулировать классами элемента.
    // classList.add() - этот метод используется для добавления 
    // класса к элементу. В качестве аргументов нужно передавать строку с именем класса.
    // menuList добавляем класс menu__list--open
    menuList.classList.add('menu__list--open')
})